// pages/menu/menu.js
Page({

  /**
   * 页面的初始数据
   */


  
  //菜谱数据
  data: { 
    

    text1:"",
    text2:"",
    text3:"",
    text4:"",
    text:"",
    url:""

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
   
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {


    console.log('menuid:', getApp().globalData.menuid);
    
    //不同城市的16种美食
    switch (getApp().globalData.menuid) {
      case '0':

        wx.setNavigationBarTitle({
          title: '遵义羊肉粉'
        });

        this.setData({ text1: "将羊肉洗净切成块放入锅中用大火煮沸，去浮沫后改用小火炖〔煮羊肉时要放入干辣椒〕 ，捞出摆齐用重物压紧，冷却5小时后切成3厘米宽、5厘米长的薄片。米粉用凉水泡透去掉酸味，放入沸水锅中烫透，用漏勺捞出装入面碗内。将羊肉片铺在粉上、舀入调好盐味的原汁汤、羊油、放入煳辣椒粉或辣椒油、再放入味精、花椒粉、芜荽、葱花即成。" });
        this.setData({ text: "闵四羊肉粉、遵义老牌师专虾子羊肉粉、“一味鲜”羊肉粉" });
        this.setData({ url: "/images/destination/遵义羊肉粉.jpg" });

        break;


      case '1':

        wx.setNavigationBarTitle({
          title: '花溪牛肉粉'
        });
        this.setData({
          text1: "（1）黄牛肉洗净切成大块下锅煮，锅开后反复打去血沫，用纱布把适量的花椒、八角、山奈、草果、沙仁、香叶、回香、桂皮、干辣椒（整个）包好，还有姜块一起放进锅中和牛肉一起小火炖，炖至牛肉基本上熟了捞出一半切成1厘米见方大小的肉丁，如有牛筋也切成丁一起再放到另一个锅中继续炖，直至炖酥烂为止，另一半待凉透了（4个小时以上）切成3厘米宽5厘米长的肉片备用。牛板油炼成牛油单独用容器盛出来备用。" });
        this.setData({ text2: "（2）米粉，用清水漂过；糊辣椒面，用干辣椒烤脆微糊打成面（不要太碎）；泡酸莲白，食用时从泡菜坛里捞出切成小片用小碟装好当做配菜；酸菜，切成1.5- 2厘米长段；芜荽节成8毫米左右的段；" });
          this.setData({ text3: "（3）食用时按下列顺序操作：米粉（有酸粉和细粉，一般一碗牛肉粉约150克-200克）放入开水锅中烫透，捞入汤碗里，在米粉上铺上牛肉片（25克），盖上炖熟的牛肉丁（25克）或牛筋丁，放上适量的酸菜，加上少许牛油，最后浇上滚烫的原汤，洒上芫荽节即可。" });
          this.setData({ text: "花溪飞碗牛肉粉、花溪王记牛肉粉" });
        this.setData({ url: "/images/destination/花溪牛肉粉.jpg" });

        break;

      case '2':

        wx.setNavigationBarTitle({
          title: '红油米豆腐'
        });

        this.setData({ text1: "1．米豆腐，大米淘洗干净泡4个小时，黄豆洗净泡5个小时，用石磨磨成浆，米/黄豆/水的比例一般为1：0.5：4，磨好下锅烧开冷却到约50度用少许石灰水点制，搅拌均匀后用搪瓷盆盛出来，完全冷却即成米豆腐。" });
        this.setData({ text2: "2．花生油炸脆、黄豆泡开用油炸酥、葱切成葱花、姜剁成细末、大蒜剁成蒜泥放在用少许冷开水中漂着、绿豆芽用开水烫熟沥干水、泡酸萝卜切成小丁、黑大头菜剁成碎末。" });
        this.setData({ text3: "3．食用时用刀把米豆腐切成长6厘米、宽高各1厘米见方长条放入碗中，淋上红油，放上葱、姜、绿豆芽、炸花生米、炸黄豆、泡酸萝卜、黑大头菜、麻油、酱油、大蒜、醋、味精拌匀入味即可。" });
        this.setData({ text: "苗彝侗寨、黔味道" });
        this.setData({ url: "/images/destination/红油米豆腐.jpg" });

        break;
        
      case '3':

        wx.setNavigationBarTitle({
          title: '丝娃娃'
        });

        this.setData({ text1: "面粉加水，盐少许揉匀挪透（水与面粉比例为1：6），平锅烧热刷油、擦干，然后左手抓起面团甩圆并向锅底杵一下成为直径为9厘米的圆薄皮时，右手立即把圆形面皮揭起，这样制作数十张春卷皮，放入蒸笼稍蒸一下使其回软，便于包食。也有的家庭制作薄皮饼会使用电熨斗，把面团杵在熨斗底部一下就可以弄出一张。再将绿豆芽、海带丝、芹菜节、蕨菜节用开水氽过，材料丰富的话，可以摆几十个盘子，有凉面，粉丝，酸藠头，酸萝卜丝，胡萝卜丝，脆哨，折耳根，莴笋丝，黄瓜丝等等，分别装入小盘中，小碗内放入酱油、醋、味精、麻油、姜沫、葱花、煳辣椒兑成汁。春卷皮中放入各种素菜丝包成上大下小的兜形，放入酥黄豆，浇淋兑好的辣椒汁即成。" });

        this.setData({ text: "飞山街杨姨妈丝娃娃、丝之味丝娃娃" });
        this.setData({ url: "/images/destination/丝娃娃.jpg" });

        break;

      case '4':

        wx.setNavigationBarTitle({
          title: '牛肉面'
        });
        this.setData({ text1: "兰州牛肉面的制作的五大步骤无论从选料、和面、饧面，还是溜条和拉面，都巧妙地运用了所含成分的物理性能，即面筋蛋白质的延伸性和弹性。兰州牛肉面的优劣除了拉面外，最重要的技含量在于淳香的汤，可以说汤是兰州牛肉面的灵魂。牛肉汤主要是几十种香料与牛肉原汤熬制而成。" });
        this.setData({
          text2: "用牛肉、肥土鸡、牛肉为主料，采用三十多种调料和中药调配熬制的老汤，经沸煮、微煮，使主料鲜味溶于汤中，中间要经过两次“清俏”，成品清澈见底，味道极其鲜美，是牛肉面里最入味儿的汤料。熬汤时选用甘南草原上出产的肥嫩牦牛肉，加牛脊髓和腿骨，牛肝，有的还添入鸡汤，再按比例加入花椒、草果、桂子、姜皮等香料在特大罐形铁锅内再加入本地特产的绿萝卜片熬成即可。" });
        this.setData({ text: "磨沟沿老字号牛肉面、金强兰州牛肉面、马安军辣子牛肉面、陈官营陈记清汤牛肉面" });
        this.setData({ url: "/images/destination/牛肉面.jpg" });
        break;

      case '5':

        wx.setNavigationBarTitle({
          title: '牛奶鸡蛋醪糟'
        });
        this.setData({ text1: "牛奶放入锅中煮到周围起小泡；放入醪糟并加入少许食用碱，煮到微开；这时均匀的倒入鸡蛋液，并且搅拌均匀（不停地搅啊搅）；出锅前撒上葡萄干和枸杞；吃之前在放上芝麻和花生果仁" });
        this.setData({ text: "老马家国华牛奶鸡蛋醪糟" });
        this.setData({ url: "/images/destination/牛奶鸡蛋醪糟.jpg" });

        break;

      case '6':

        wx.setNavigationBarTitle({
          title: '酿皮子'
        });

        this.setData({ text1: "（1）制面浆。将面粉放入盆中，分次加水，第一次加水10公斤，用木勺搅拌成稠浆糊，加入精盐250克，继续加水5公斤，再用力搅拌成稀浆糊，最后再加水1公斤，同时把碱面10克化成水倒入盆中，再继续搅拌均匀，用勺扬起，能拉成条，即成面浆。" });
        this.setData({
          text2: "（2）笼蒸。蒸笼里铺上净屉布，臼入薄薄一层面浆，旺火蒸10分钟即成。" });
        this.setData({ text3: "（3）调味。一般按每碗100克装。将焯熟的绿豆芽放入碗底，再放入酿皮，然后调入芝麻酱、精盐、酱油、香醋、油泼辣椒即成。" });
        this.setData({ text: "尕媳妇酿皮子、七祺祥大宽酿皮" });
        this.setData({ url: "/images/destination/酿皮子.jpg" });
        break;
      
      case '7':

        wx.setNavigationBarTitle({
          title: '炒凉粉'
        });

        this.setData({ text1: "凉粉切成1至2CM左右的小四方块；葱蒜切碎，干辣椒切成小段；调一份浇汁：水小半碗 生粉 酱油少量 生抽少量 葱花 蒜蓉； 锅里油烧热，爆香葱蒜干和辣椒段，加入一勺豆瓣酱中小火炒香，放入切好的凉粉块翻炒均匀；倒入调好的浇汁，中小火盖锅盖闷一分钟，中途可以翻炒下防止糊锅；翻炒片刻即可出锅。出锅前撒些葱花点缀哈子。" });
        this.setData({ text: "高升记大众高担酿皮、" });
        this.setData({ url: "/images/destination/炒凉粉.jpg" });

        break;

      case '8':

        wx.setNavigationBarTitle({
          title: '丝路驼掌'
        });

        this.setData({
          text1: "1、去毛及底皮的驼掌下入垫上蓖子的水锅中烧开，加入部分葱、姜、花椒和白糖煮四小时，除去骨头漂洗后再换锅加入鸡汤适量，放入驼掌，加葱、姜、花椒、冬菇、火腿、冬笋煨至熟透，取出凉后，切成大小均匀的片，碗底放一块洗净的冬菇，一片片摆布在碗内，灌入鸡汤加盐、糖、料酒、胡椒面的清汁，上笼蒸至熟粑，热着待用。" });
        this.setData({ text2: "2、蛋清制成高丽糊，加入淀粉，盐拌匀，在大盘的一边堆成雪山上笼蒸约5分钟，菜心焯水后浇上味待用。" });
        this.setData({ text3: "3、将驼掌碗内汤汁滗出后，翻扣盘中央，围上菜心，挂上加酱油、味精勾芡的原汁，盘另一边摆上菜松（形于雪山相对应）即成。" });
        this.setData({ text: "七一冰川嘉峪关城楼" });
        this.setData({ url: "/images/destination/丝路驼掌.jpg" });

        break;

      case '9':

        wx.setNavigationBarTitle({
          title: '粉蒸牛羊肉'
        });

        this.setData({
          text1: "将肥羊肉5公斤冲洗干净，切成约3厘米长，1.5厘米宽，0.6厘米厚的片，放进瓷盆内，加入精盐250克，花椒粉40克，五香粉60克及适量清油，用手搅拌均匀，腌渍约10小时。关于腌肉时间，各家时间不一，一般是冬天腌约10小时以上，夏天约5—6小时。蒸肉要好吃，腌到肉是关键，所以无论春夏秋冬，都腌肉12小时。随后徐徐倒入约3500克面粉，用手拌匀。若面粉不能完全附着在肉片上时，加入适量清油，致使面粉都粘附在肉片上。" });
        this.setData({
          text2: "用肉片拌面时，绝对不能加水。如果面粉粘不上肉片，可以加些清油。面粉加水，就会形成死面团，死面团上笼蒸熟，就成了硬面块。拌面粉时加些清油，蒸出来的粉蒸肉就油润酥软，因为清油和面粉形不成死面团。肉片拌好面粉后，开始上笼。在笼底铺上湿笼布，将拌好的肉片均匀地摊在笼布上，不能超过6—7厘米，要摊得松而有空隙，以利于蒸透。另外，一定要放些羊腰窝油，然后用旺火蒸约2—3小时即成。蒸肉的质量要求是肉片酥嫩，面粉柔软，鲜香味美。" });
        this.setData({ text: "靖远尕六美味羊羔肉" });
        this.setData({ url: "/images/destination/粉蒸牛羊肉.jpg" });

        break;

      case '10':

        wx.setNavigationBarTitle({
          title: '油爆驼峰'
        });

        this.setData({
          text1: "1.将驼峰用温水泡6 小时，修去杂物，洗净，放锅煮3 小时捞出，再用凉水冲洗干净，切成1 厘米厚的片，两面刻上直花刀，然后改成1 厘米见方的丁，放开水锅内加料酒25 克，氽两次，捞出沥干水分，加湿淀粉20 克拌匀。2，香菜摘洗干净，切成1 厘米长的段。3.酱油、味精、食盐、胡椒面、湿淀粉加肉汤150 克兑成汁。4.锅内加猪油烧六成热，将驼峰下入，滑散倒漏勺内控油。锅内留油50克，放葱、姜、蒜炝锅，倒入兑汁爆起，再倒入滑好的驼峰，颠匀后盛入盘内，撒上香菜即可。" });
        this.setData({ text: "东关人家" });
        this.setData({ url: "/images/destination/油爆驼峰.jpg" });

        break;

      case '11':

        wx.setNavigationBarTitle({
          title: '烧壳子'
        });

        this.setData({ text1: "用酵母把面发好对适量碱，将干羊粪在门外堆成一堆点着烧，羊粪全部烧过不冒烟时，把面擀成烧锅大小圆形，放入热锅内盖上盖，扒开烧好的火堆，把烧锅埋入火内。烧锅系生铁铸成，形状似带盖的圆铁盒，盖中间有挑盖的耳子，有大有小。埋入火中，由于上下左右四面加温，里面的烧饼上下和边缘都上火，烤得黄而脆。" });
        this.setData({ text: "振兴市场美食一条街、大唐美食街" });
        this.setData({ url: "/images/destination/烧壳子.jpg" });

        break;  

      case '12':

        wx.setNavigationBarTitle({
          title: '手抓羊肉'
        });

        this.setData({ text1: "1、将羊腰窝肉剁成二寸长、五分宽的块，用水洗净。香菜去根洗净消毒，切成二分长的段。葱，三钱切成一寸长的段、二钱切末；" });
        this.setData({ text2: "2、把葱末，蒜末，香菜。酱油，味精，胡椒粉，芝麻油，辣椒油等对成调料汁；" });
        this.setData({ text3: "3、锅内倒入清水二斤，放入羊肉在旺火上烧开后，撇去浮沫，把肉捞出洗净。接着，再换清水三斤烧开，放入羊肉、大料、花椒、小茴香、桂皮、葱段、姜片、绍酒和精盐。待汤再烧开后，盖上锅盖，移在微火上煮到肉烂为止。将肉捞出，盛在盘内，蘸着调料汁吃。" });
        this.setData({ text: "老毛手抓、国强手抓" });
        this.setData({ url: "/images/destination/手抓羊肉.jpg" });

        break;

      case '13':

        wx.setNavigationBarTitle({
          title: '烩羊杂碎'
        });

        this.setData({ text1: "羊头、羊蹄用火烧尽残毛，羊肠、羊肚翻去残渣。洗净后连同羊心羊肝一起下锅煮熟，拆去骨头，分别切成条或段。羊肺用洗去面筋的稀面糊灌好后，也下锅煮熟，切成长条。然后将切好的各种熟料放在羊肉汤里略煮片刻，撒上蒜苗、香菜，滴上红油盛碗即成。" });
        this.setData({ text: "纳家户羊杂碎、阿叶羊杂碎、老西门羊杂碎" });
        this.setData({ url: "/images/destination/烩羊杂碎.jpg" });

        break;

      case '14':

        wx.setNavigationBarTitle({
          title: '回乡馓子'
        });

        this.setData({ text1: "制作馓子要用上好的面粉，加少许食盐用水揉成面坯，然后饧面、切条，再搓成条状，环绕排满盆中，上面洒抹一些食用油。待面条在盆中回透，弹拉力恰到好处时，将面条绕在手上，用手来回抻开，撑、绷成粗细均匀一致的馓子条，然后放入油锅，用筷子轻轻翻动，掌握火候煎熬上色，炸成大把或小把金黄焦脆的馓子。" });
        this.setData({ text: "黄金香焖饼、同心春饼子铺、宫廷酥牛肉饼" });
        this.setData({ url: "/images/destination/回乡馓子.jpg" });

        break;

      case '15':

        wx.setNavigationBarTitle({
          title: '清蒸羊羔肉'
        });

        this.setData({
          text1: "原料：羊羔肉（带骨）、面粉。大葱。鲜姜、香菜、精盐、味精 、花椒大料油、植物油。" });
        this.setData({ text2: "制法：羊羔肉带骨剁成小块，用精盐味精、花椒大料油和适量面粉拌匀入味后放在小碗里，上面再放上大葱、鲜姜，然后上笼蒸熟即成。吃时，可撒上香菜，配以干粮馍。" });
        this.setData({ text: "同心春、三益轩" });
        this.setData({ url: "/images/destination/清蒸羔羊肉.jpg" });

        break;   
    }

    
  
  
  





  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})